growup/app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2015-01-07 15:22:30', 'admin', '$2a$10$SblMLqAS.QJ5c4sNnDZdROOjfkKblSdNA/bcqc6lj0w.zzNyIDnKO', '$2a$10$SblMLqAS.QJ5c4sNnDZdRO', '2015-01-07 15:22:30')
---
  def create
	@user = User.new(params[:user])
	if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
	if current_user
	@user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "email" = 'test', "password_salt" = '$2a$10$hGM/1HrPzDW0NlbPLP3So.', "password_hash" = '$2a$10$hGM/1HrPzDW0NlbPLP3So.gMLaqqVU14NbYGvEnUrAYmGp5cGj166', "updated_at" = '2015-01-05 18:54:25.394205' WHERE "users"."id" = 2
---
  def update
    @user = User.find(session[:user_id])

    respond_to do |format|
      @user.update_attributes(params[:user])