app/controllers/organizations_controller.rb

  def create
    @organization = current_user.created_organizations.new(organization_params)
---
INSERT INTO "organizations" ("name", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "444"], ["description", "4545"], ["creator_id", 1], ["created_at", "2015-08-04 15:30:34.617959"], ["updated_at", "2015-08-04 15:30:34.617959"]]

  def edit
    @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 62]]

  def update

    @organization = Organization.find(params[:id])

    if  @organization.present?
      @organization.update_attributes(organization_params)
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "organizations" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "organizations"."id" = $4  [["name", "First"], ["description", "#1"], ["updated_at", "2015-08-03 13:33:09.414115"], ["id", 62]]

  def destroy

    @organization = Organization.find(params[:id])
    @organization.destroy
---
SELECT  "user_organizations".* FROM "user_organizations" WHERE "user_organizations"."organization_id" = $1 AND "user_organizations"."id" = $2 LIMIT 1  [["organization_id", 51], ["id", 51]]
DELETE FROM "user_organizations" WHERE "user_organizations"."id" = $1  [["id", 46]]