app/controllers/projects_controller.rb

  def index
    @organization = Organization.find(params[:organization_id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 89]]

  def new
    @organization = Organization.find(params[:organization_id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 89]]

  def create
    @organization = Organization.find(params[:organization_id])
    @project = Project.new(project_params)

    if @project.save{
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 89]]
INSERT INTO "projects" ("name", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "re"], ["organization_id", 89], ["created_at", "2015-08-05 14:35:50.826164"], ["updated_at", "2015-08-05 14:35:50.826164"]]

  def edit
    @organization = Organization.find(params[:organization_id])
    @project = Project.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 89]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 11]]

  def update
    @organization = Organization.find(params[:organization_id])
    @project = Project.find(params[:id])

    if  @project.update_attributes(project_params)
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", 94]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "projects" SET "name" = $1, "organization_id" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["name", "Proj#3"], ["organization_id", 14], ["updated_at", "2015-08-06 12:46:32.158361"], ["id", 14]]