app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @uploads = Upload.all